public/programming/gists/scripts/win2usb.sh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org4cd05f1" class="outline-2">
<h2 id="org4cd05f1">Scripts / win2usb.sh</h2>
<div class="outline-text-2" id="text-org4cd05f1">
<p>
Copy the windows installer to an USB pen from Linux.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #989898;">#</span><span style="color: #989898;">!/bin/</span><span style="color: #b6a0ff;">sh</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">win2usb.sh
</span><span style="color: #989898;"># </span><span style="color: #989898;">==========
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">Copy the windows installer to an USB pen from Linux
</span><span style="color: #989898;"># </span><span style="color: #989898;">The installer may complain if you are not installing
</span><span style="color: #989898;"># </span><span style="color: #989898;">windows on an NTFS partition, in such case you can
</span><span style="color: #989898;"># </span><span style="color: #989898;">format one of your disks with
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;">#    </span><span style="color: #989898;">sudo mkntfs --fast /dev/sdX1
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">Author: Giovanni Santini
</span><span style="color: #989898;"># </span><span style="color: #989898;">Github: @San7o
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span>
<span style="color: #f78fe7;">set</span> -ex

<span style="color: #b6a0ff;">if</span> [ <span style="color: #ff5f59; font-weight: bold;">!</span> command -v woeusb &gt;/dev/null 2&gt;&amp;1 ]; <span style="color: #b6a0ff;">then</span>
        <span style="color: #f78fe7;">echo</span> <span style="color: #79a8ff;">"You need to have woeusb installed"</span>
        <span style="color: #f78fe7;">echo</span> <span style="color: #79a8ff;">"ubuntu: sudo apt install woeusb"</span>
        <span style="color: #f78fe7;">echo</span> <span style="color: #79a8ff;">"fedora: sudo dnf install WoeUSB"</span>
        <span style="color: #b6a0ff;">exit</span> 1
<span style="color: #b6a0ff;">fi</span>

<span style="color: #b6a0ff;">if</span> [ $<span style="color: #00d3d0;">#</span> -ne 2 ]; <span style="color: #b6a0ff;">then</span>
        <span style="color: #f78fe7;">echo</span> <span style="color: #79a8ff;">"usage: ./win2usb.sh &lt;device&gt; &lt;windowsX.iso&gt;"</span>
        <span style="color: #b6a0ff;">exit</span> 1
<span style="color: #b6a0ff;">fi</span>


<span style="color: #989898;"># </span><span style="color: #989898;">Use lkblk to get the name of the device
</span><span style="color: #00d3d0;">DEVICE</span>=<span style="color: #79a8ff;">"$1"</span>
<span style="color: #00d3d0;">ISO</span>=<span style="color: #79a8ff;">"$2"</span>

wipefs -a /dev/$<span style="color: #00d3d0;">DEVICE</span>
parted /dev/$<span style="color: #00d3d0;">DEVICE</span> mklabel gpt
parted -a optimal /dev/$<span style="color: #00d3d0;">DEVICE</span> mkpart primary ntfs 0% 100%
mkfs.ntfs -f /dev/${<span style="color: #00d3d0;">DEVICE</span>}1
woeusb --device $<span style="color: #00d3d0;">ISO</span> /dev/$<span style="color: #00d3d0;">DEVICE</span> --target-filesystem NTFS

<span style="color: #f78fe7;">echo</span> <span style="color: #79a8ff;">"$ISO installed in /dev/$DEVICE. You can boot the system now."</span>
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
